02_VendaSimples/payload-teste.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://multiclubes.com.br/tickets/v2">
    <soapenv:Header>
        <_AuthenticationKey xmlns="ns">3fe6ca43-65cc-4776-9fb8-667855dbd6e0</_AuthenticationKey>
    </soapenv:Header>
    <soapenv:Body>
        <v2:Sell>
            <v2:data>
                <v2:PaymentLink>
                    <v2:DueDays>1</v2:DueDays>
                    <v2:WebhookUrl>https://webh.criativamaisdigital.com.br/webhook/66015730-101c-4441-b93b-bdbecc963461</v2:WebhookUrl>
                </v2:PaymentLink>

                <v2:Tickets>
                    <v2:SaleItemData>
                        <v2:Address>
                            <v2:Burgh>Parque Santana</v2:Burgh>
                            <v2:City>Barra do Piraí</v2:City>
                            <v2:Country>Brasil</v2:Country>
                            <v2:Number>31</v2:Number>
                            <v2:PostalCode>27143610</v2:PostalCode>
                            <v2:State>Rio de Janeiro</v2:State>
                            <v2:Street>Travessa B</v2:Street>
                        </v2:Address>
                        <v2:Document>12345678900</v2:Document>
                        <v2:Email>tester@teste.com</v2:Email>
                        <v2:Name>Nome Teste Completo</v2:Name>
                        <v2:PhoneNumber>24999999999</v2:PhoneNumber>
                        <v2:Quantity>1</v2:Quantity>
                        <v2:TicketId>RQG68055</v2:TicketId>
                        <v2:Values>
                            <v2:DueValue>100.00</v2:DueValue>
                            <v2:PaidValue>0</v2:PaidValue>
                        </v2:Values>
                    </v2:SaleItemData>
                </v2:Tickets>
                <v2:Values>
                    <v2:DueValue>100.00</v2:DueValue>
                    <v2:PaidValue>0</v2:PaidValue>
                </v2:Values>
                <v2:VisitDate>2025-12-14</v2:VisitDate>
            </v2:data>
        </v2:Sell>
    </soapenv:Body>
</soapenv:Envelope>